# Описание решения задачи:

================================================================

## Условие:

> Написать программу, которая из имеющегося массива строк формирует массив из
> строк, длина которых меньще либо равна 3 символа.
> Первоначальный массив можно ввести с клавиатуры, либо задать на старте
> выполнения алгоритма. При решении не рекомендуется пользователь коллекциями,
> лучше обойтись исключительно массивами"

1. Начало программы;
2. Задаем массив (с клавиатуры или на старте), тип переменной String;
3. Заполняем массив строками;
4. Задаем функцию, которая возвращает результирующий массив строк, длина которых меньше либо равна 3 символа. Тип переменной String;
5. Задаем пустой массив размером заданного массива для записи в него результата, тип переменной String;
6. С помощью цикла while или for перебираем заданный на старте массив;
7. Условием выхода из цикла будет значение индекса равное длине массива;
8. В цикле задаем условие, при котором, элемент массива длинною менее 3-х символов записывается в результирующий массив;
9. Создаем новый массив тип String, присваеваем ему вызов функции нахождения элементов равных или меньше 3-х символов.
10. В качестве аргумента передаем в функцию заданный массив на старте;
11. После выполнения функции в ранее созданную переменную присвоится результирующий массив строк;
12. Для печати массива используем функцию Console.WriteLine
13. В Console.WriteLine передаем метод Join, который сцепляет все элементы массива строк, помещая между ними заданный разделитель
14. В качестве разделителя по примеру задачи используем запятую.
15. Выводится на экран массив из строк, длина которых меньще либо равна 3 символа
16. Конец программы.
