/*
// Есть магазин "Ромашка"
// Охранник ведёт журнал посещения
// 11-13
// 10-14
// 9-10
// 11-22
// 18-18
// 0-23
// 4-5
// 4-5
// 4-5

// Суть: показать интервалы, когда было больше всего 
// людей в магазине

// Ответ: 4-5, 11-13

*/

string[] record1 = {"11-13", "10-14", "9-10", "11-22", "18-18", "0-23", "4-5", "4-5", "4-5", "4-5"};

//Console.WriteLine(record1[0]);

// 1 вариант
// "11-44"  перебрать по дефису(-)

// 2 вариант
string s = "11-44";
var pos = s.IndexOf('-');
Console.WriteLine(s.Substring(0, pos)); // 11
Console.WriteLine(s.Substring(pos + 1));    // 44

// 3 вариант (.split)
string[] arg = s.Split('-');
Console.WriteLine(arg[0]);  // 11
Console.WriteLine(arg[1]);  // 44
